[
  {
    "aboutMe": [
      "./img/aboutme.png",
      "Hi I'm androoIT",
      "Some time ago I developed a few VBA-based tools to support my day-to-day work on some international projects, and since that time I have put my attention toward programming. I graduated from an intensive bootcamp in coding school, and I'm improving my skills by learning on my own. I aim to continue my career as a full-stack JavaScript programmer. I assure you that I will do anything to fulfill your expectations as a software developer."
    ],
    "personality": [
      "My personality type is an Architect",
      "according to Myers-Briggs personality model",
      "https://www.16personalities.com/intj-personality"
    ],
    "personalityDesc": [
      [
        "Click all my Strengths to find out more:"
      ],
      [
        "Strong Analytical and Strategic Thinking Skills",
        "Architects have a natural talent for analyzing complex problems and developing strategic solutions. They can see the big picture and understand how different elements fit together, allowing them to identify the root causes of problems and develop effective strategies to address them. This makes them an asset in any role that requires critical thinking, problem-solving, and strategic planning."
      ],
      [
        "Creative and Innovative Thinking",
        "While Architects excel at analytical and strategic thinking, they also have a creative and visionary side. They are always looking for new and innovative ways to approach problems and challenges, and they thrive on exploring new ideas and possibilities. This makes them an asset in roles that require innovation, creativity, and the ability to think outside the box."
      ],
      [
        "Commitment to Excellence",
        "Architects are driven by a desire to achieve excellence in everything they do. They are always striving to improve their skills and knowledge, and they take pride in their work. This makes them an asset in any role that requires a high degree of attention to detail, quality control, and a commitment to delivering exceptional results"
      ],
      [
        "Independent and Self-Motivated",
        "Architects are independent thinkers who prefer to work alone or in small groups. They are self-motivated and can work effectively without constant supervision or direction. This makes them an asset in roles that require a high degree of autonomy and self-direction."
      ],
      [
        "Strategic Vision",
        "Architects are strategic thinkers who can see the big picture and understand how different elements fit together. They are able to identify opportunities and threats, and they can develop long-term plans to achieve organizational goals. This makes them an asset in leadership roles, where they can provide strategic vision and direction for the organization."
      ],
      [
        "Overall the Architect personality type brings a unique set of skills and qualities to the workplace. Their analytical, strategic, and innovative approach to problem-solving, combined with their commitment to excellence and ability to work independently, make them an asset in a wide range of roles and industries. If you're looking for a talented, self-motivated, and results-driven professional, consider hiring an Architect."
      ]
    ]
  },
  {
    "aboutMe": [
      "Image FILE",
      "Cześć, jestem androoIT",
      "Stworzyłem narzędzia w VBA dla ułatwienia własnej pracy i od tamtej pory nieustannie pasjonuje mnie programowanie. Ukończyłem intensywny bootcamp w szkole programowania i od tamtej pory samodzielnie doskonalę swoje umiejętności. Chcę się rozwijać się jako programista full-stack JavaScript. Zapewniam, że sprostam Państwa oczekiwaniom jako programista."
    ],
    "personality": [
      "Moim typem osobowości jest Architekt",
      "zgodnie z modelem osobowości Myers-Briggs",
      "https://pl.wikipedia.org/wiki/Test_Myers-Briggs"
    ],
    "personalityDesc": [
      [
        "Kliknij na wszystkiem moje silne strony, aby dowiedzieć się więcej:"
      ],
      [
        "Silne umiejętności analityczne i strategiczne",
        "Architekci posiadają naturalny talent do analizowania skomplikowanych problemów i opracowywania strategicznych rozwiązań. Potrafią zobaczyć całościowy obraz i zrozumieć, jak różne elementy łączą się ze sobą, co pozwala im zidentyfikować główne przyczyny problemów i opracować skuteczne strategie ich rozwiązania. To czyni ich cennym pracownikiem w każdej roli, która wymaga myślenia krytycznego, rozwiązywania problemów i planowania strategicznego."
      ],
      [
        "Kreatywne i innowacyjne myślenie",
        "Podczas gdy Architekci wyróżniają się umiejętnościami analitycznymi i strategicznymi, posiadają także kreatywny i wizjonerski aspekt. Zawsze szukają nowych i innowacyjnych sposobów na podejście do problemów i wyzwań, a odkrywanie nowych pomysłów i możliwości sprawia im przyjemność. To czyni ich cennym pracownikiem w rolach wymagających innowacyjności, kreatywności i zdolności do myślenia poza schematami."
      ],
      [
        "Zobowiązanie do doskonałości",
        "Architekci są napędzani chęcią osiągania doskonałości we wszystkim, co robią. Zawsze dążą do doskonalenia swoich umiejętności i wiedzy, a ich praca sprawia im dumę. To czyni ich cennym pracownikiem w każdej roli, która wymaga dużej dbałości o szczegóły, kontroli jakości i zobowiązania do osiągania wyjątkowych wyników."
      ],
      [
        "Niezależność i samodzielność",
        "Architekci to niezależni myśliciele, którzy preferują pracę samodzielnie lub w małych grupach. Są samodzielnie zmotywowani i potrafią pracować skutecznie bez ciągłego nadzoru lub kierowania. To czyni ich cennym pracownikiem w rolach wymagających dużej autonomii i samodzielności."
      ],
      [
        "Wizja strategiczna",
        "Architekci to myśliciele strategiczni, którzy potrafią zobaczyć całościowy obraz i zrozumieć, jak różne elementy łączą się ze sobą. Są w stanie zidentyfikować szanse i zagrożenia, a także potrafią opracować długoterminowe plany osiągania celów organizacyjnych. To czyni ich atutem w rolach przywódczych, gdzie mogą zapewnić strategiczną wizję i kierunek dla organizacji.”"
      ],
      ["Ogólnie rzecz biorąc, typ osobowości Architekt wnosi do miejsca pracy unikalny zestaw umiejętności i cech. Ich analityczne, strategiczne i innowacyjne podejście do rozwiązywania problemów, w połączeniu z dążeniem do doskonałości i zdolnością do niezależnej pracy, czynią z nich atut w wielu rolach i branżach. Jeśli szukasz utalentowanego, zmotywowanego i nastawionego na wyniki profesjonalisty, rozważ zatrudnienie architekta."]
    ]
  },
  {
    "aboutMe": [
      "Image FILE",
      "Hi, Ich bin androoIT",
      "Ich habe einige VBA-basierte Werkzeuge zur Unterstützung meiner Tagesarbeit entwickelt und seitdem widme ich mich dem Programmieren. Mit Vergnügen habe Ich ein intensives Bootcamp an der Software Entwicklers School absolviert und seitdem verbessere ich meine Fähigkeiten auf eigene Faust. Ich möchte meine Karriere als Javascript Full- Stack-Programmierer fortsetzen. Ich kann Ihnen versichern, dass ich persönlich motiviert bin, alles zu tun, um Ihre Erwartungen als Software-Entwickler zu erfüllen."
    ],
    "personality": [
      "Mein Persönlichkeitstyp ist ein Architekt",
      "nach Myers-Briggs Persönlichkeitsmodell",
      "https://de.wikipedia.org/wiki/Myers-Briggs-Typenindikator"
    ],
    "personalityDesc": [
      [
        "Klicken Sie auf alle meine Stärken, um mehr zu erfahren"
      ],
      [
        "Starke analytische und strategische Denkfähigkeiten",
        "Architekten haben ein natürliches Talent zur Analyse komplexer Probleme und zur Entwicklung strategischer Lösungen. Sie können das große Ganze sehen und verstehen, wie verschiedene Elemente zusammenpassen, was es ihnen ermöglicht, die Ursachen von Problemen zu identifizieren und effektive Strategien zu ihrer Bewältigung zu entwickeln. Dies macht sie zu einer Bereicherung in jeder Position, die kritisches Denken, Problemlösung und strategische Planung erfordert."
      ],
      [
        "Kreatives und innovatives Denken",
        "Während Architekten in analytischem und strategischem Denken brillieren, haben sie auch eine kreative und visionäre Seite. Sie suchen immer nach neuen und innovativen Möglichkeiten, Probleme und Herausforderungen anzugehen, und sie gedeihen bei der Erkundung neuer Ideen und Möglichkeiten. Dies macht sie zu einer Bereicherung in Positionen, die Innovation, Kreativität und die Fähigkeit erfordern, über den Tellerrand hinauszudenken."
      ],
      [
        "Engagement für Exzellenz",
        "Architekten werden von dem Wunsch angetrieben, Exzellenz in allem, was sie tun, zu erreichen. Sie streben immer danach, ihre Fähigkeiten und ihr Wissen zu verbessern, und sie sind stolz auf ihre Arbeit. Dies macht sie zu einer Bereicherung in jeder Position, die ein hohes Maß an Aufmerksamkeit für Details, Qualitätskontrolle und Engagement für die Lieferung außergewöhnlicher Ergebnisse erfordert."
      ],
      [
        "Unabhängig und selbstmotiviert",
        "Architekten sind unabhängige Denker, die lieber alleine oder in kleinen Gruppen arbeiten. Sie sind selbstmotiviert und können effektiv ohne ständige Aufsicht oder Anleitung arbeiten. Dies macht sie zu einer Bereicherung in Positionen, die ein hohes Maß an Autonomie und Selbststeuerung erfordern."
      ],
      [
        "Strategische Vision",
        "Architekten sind strategische Denker, die das große Ganze sehen und verstehen können, wie verschiedene Elemente zusammenpassen. Sie sind in der Lage, Chancen und Bedrohungen zu identifizieren und langfristige Pläne zur Erreichung der organisatorischen Ziele zu entwickeln. Dies macht sie zu einer Bereicherung in Führungspositionen, wo sie strategische Vision und Richtung für die Organisation bieten können."
      ],
      [
        "Insgesamt bringt der Architekten-Persönlichkeitstyp eine einzigartige Reihe von Fähigkeiten und Qualitäten am Arbeitsplatz mit. Ihre analytische, strategische und innovative Herangehensweise an die Problemlösung, kombiniert mit ihrem Engagement für Exzellenz und ihrer Fähigkeit, unabhängig zu arbeiten, machen sie zu einer Bereicherung in einer Vielzahl von Positionen und Branchen. Wenn Sie einen talentierten, selbstmotivierten und ergebnisorientierten Profi suchen, sollten Sie einen Architekten einstellen."
      ]
    ]
  }
]