[
    {
        "recommendedBooksIntro":["I like learning new things from the books, bacause the books are more synthethic and thought over than publication you can find in the network. The Positions I read and I can recommend as valuable are as follows:",
    "Lubię uczyć się nowych rzeczy z książek, bo są one bardziej syntetyczne i przemyślane niż publikacje, które można znaleźć w sieci. Pozycje, które mogę przeczytać i które mogę polecić jako wartościowe, to:",
    "Ich lerne gerne Neues aus den Büchern, weil die Bücher synthetischer und durchdachter sind als Veröffentlichungen, die man im Netz finden kann. Die Positionen, die ich lesen und als wertvoll empfehlen kann, sind die folgenden:"],
    
        "coverFrontsource": "./img/reactReceptury.webp",
        "coverBacksource":  "",
        "title":        "React. Receptury. Poradnik dla zaawansowanych",
        "authors":        "Griffiths David, Griffiths Dawn",
        "version":        "1",
        "year":        "year 2022",
        "description": ["Very complex lecture - I whisch I had time to try it all", "Bardzo wszechstronna publikacja - aby tylko był czas spróbować wszystkiego","Sehr komplexe Vorlesung – ich wünschte, ich hätte Zeit, alles auszuprobieren"]
    },
    {
        "coverFrontsource": "./img/reactRedux.jpeg",
        "coverBacksource":  "",
        "title":        "React i Redux. Praktyczne tworzenie aplikacji WWW. Wydanie II",
        "authors":        "Kirupa Chinnathambi ",
        "version":        "2",
        "year":        "year 2019",
        "description": ["Outdated, but usable for maintaining legacy code","Przestarzała publikacja, ale użyteczny do utrzymania starszego kodu", "Veraltet, aber für die Pflege von Legacy-Code verwendbar"]
    },
   
    
    {
        "coverFrontsource": "./img/React4jobseekers.png",
        "coverBacksource":  "",
        "title":        "ReactJS for Jobseekers: The Only Guide You Need to Learn React and Crack Interviews",
        "authors":        "Qaifi Khan ",
        "version":        "1",
        "year":        "year 2023",
        "description": ["Different view - some valuable remarks", "Inne spojrzenie - kilka cennych uwag","Andere Sichtweise – einige wertvolle Bemerkungen"]
    },
    {
        "coverFrontsource": "./img/LearningReact.png",
        "coverBacksource":  "",
      
        "title":        "React od podstaw. Nowoczesne wzorce tworzenia aplikacji",
        "authors":        "Alex Banks, Eve Porcello",
        "version":        "2",
        "year":        "year 2021",
        "description": ["A very good read - my #1 manual for react","Bardzo dobra lektura - mój podręcznik nr 1 do react","Eine sehr gute Lektüre – mein Nr. 1-Handbuch für React" ]
    },
    {
        
        "coverFrontsource": "./img/jspackt.png",
        "coverBacksource":  "",
        "title":        "JavaScript from Beginner to Professional: Learn JavaScript quickly by building fun, interactive, and dynamic web apps, games, and pages",
        "authors":        " Laurence Lars Svekis, Maaike van Putten, Rob Percival ",
        "version":        "1",
        "year":        "year 2021",
        "description": ["Good Book for review JS knowledge on each level of expirience","Dobra książka do rewizji wiedzy o JS na każdym poziomie zaawansowania","Ein gutes Buch, um JS-Kenntnisse auf jedem Fortschrittsniveau zu wiederholen"]
    },
    {
        "coverFrontsource": "./img/JSTheDefinitiveGuide.png",
        "coverBacksource":  "",
        "title":        "JavaScript The Definitive Guide",
        "authors":        "David Falanagan",
        "version":        "7",
        "year":        "year 2020",
        "description":["Best programming book ever - Book covers everything in logicall sequential manner","Najlepsza książka o programowaniu wszechczasów - Książka obejmuje wszystko w logiczny i sekwencyjny sposób","Bestes Programmierbuch aller Zeiten – Das Buch deckt alles in logischer Reihenfolge ab"]
    }
    ,
    { 
      "coverFrontsource": "./img/eloquentJS.png",
      "coverBacksource":  "",
      "title":        "Eloquent JavaScript, 3rd Edition: A Modern Introduction to Programming 3rd Edition",
      "authors":        "Marijn Haverbeke",
      "version":        "3",
      "year":        "year 2018",
      "description":["Good Book for learn and review JS","Dobra książka do nauki i przeglądu JS","Ein gutes Buch zum Erlernen und Wiederholen von JS"]
    },


  { 
    "coverFrontsource": "./img/wp.webp",
    "coverBacksource":  "",
    "title":        "WordPress. Tworzenie aplikacji internetowych w.2",
    "authors":        "Brian Messenlehner, Jason Coleman",
    "version":        "2",
    "year":        "year 2021",
    "description":["Quite good book, which explains WP basic concepts. It allowed me to understand WP.","Ein gutes Buch, das die Grundkonzepte von WP erklärt. Sie hat mir geholfen, WP zu verstehen.",""]
  },

  { 
    "coverFrontsource": "./img/pragmaticProgrammer1.webp",
    "coverBacksource":  "",
    "title":        "The Pragmatic Programmer",
    "authors":        "David Thomas Hunt Andrew",
    "version":        "20th anniversary edition",
    "year":        "year 2019",
    "description":["It's all about your attitude, the rest you can learn from manuals... Book is a must read","Wszystko zależy od Twojego nastawienia, reszty dowiesz się z podręczników... Książka to obowiązkowa lektura","Es kommt nur auf Ihre Einstellung an, den Rest können Sie aus Handbüchern lernen ... Das Buch ist eine Pflichtlektüre"]
  }
  
    
]