[
    {
    
    
    




    "menu": ["About me","Technologies", "www Projects", "Library", "Blog"],
    "menuPl": ["O mnie","Technologie", "Projekty www", "Biblioteka", "Blog"],
    "menuDe": ["Über mich","Technologien", "www Projekte“, „Bibliothek“, „Blog"],
       
    "wwwProjectsIntro":"Here are some basic information about the projects I made. You can view some details by clicking at thumbinals, which will guide you to the website or click for more details at github icon.",
    "wwwProjectsIntroPl":"Poniżej zamieszczono kilka podstawowych informacji o projektach, które wykonałem. Możesz wyświetlić niektóre szczegóły, klikając miniatury, które poprowadzą Cię do witryny lub kliknij, aby uzyskać więcej informacji, na ikonie github.",
    "wwwProjectsIntroDe":"Nachfolgend finden Sie einige grundlegende Informationen über die Projekte, die ich gemacht habe. Sie können einige Details anzeigen, indem Sie auf die Miniaturansichten klicken, die Sie zur Website führen, oder klicken Sie für weitere Informationen auf das Github-Symbol.",
    "wwwProjects":{
        "project1":{
            "title": "TourFast Warsaw",
            "titlePl": "TourFast Warszawa",
            "titleDe": "TourFast Warschau",
            "time": "2019",
            "Description": "Website created for a start-up offering quick sightseeing of the capital city of Warsaw in a modern and fast way on electric scooters.",
            "DescriptionPl": "Witryna zrealizowana dla start-upu, oferującego szybkie zwiedzanie miasta stołecznego Warszawy w nowoczesny i szybki sposób na hulajnogach elektrycznych.",
            "DescriptionDe": "Für ein Start-up erstellte Website, die eine schnelle Besichtigung der Hauptstadt Warschau auf moderne und schnelle Weise mit Elektrorollern bietet.",
            "technologies":["HTML", "CSS", "Javascript","PHP","MySQL","PHP My Admin","Wordpress","Elementor","Youtube API","Facebook API","Google translate API","Google Analytics"],
            "githublink": "",
            "screenshot":"",
            "link":"https://TourFast.pl"
        },
        "project2":"",
        "project3":{
            "title": "We propel Transport 4.0",
            "titlePl": "Napędzamy Transport 4.0",
            "titleDe": "Wir treiben Verkehr 4.0 voran",
            "time": "2018",
            "Description":"Design of the website of the initiative, the aim of which is to introduce mobility management in Poland based on the cooperation of environments shaping mobility with the leading role of the community using the transport system. The change that the project aims to achieve consists in changing the approach to transport management from BBB (Build Build Build) to an approach in which transport projects compete with each other based on user experience (UX) and measurable performance indicators (KPI) focused on the mobility of Poles and Europeans. The trigger for change is the digital revolution. Current technology allows for obtaining reliable data in real time and therefore special attention is paid to IT systems in transport: GSM-R, ETCS, ITS, SESAR, RIS, VTMIS and social media.",
            "DescriptionDe":"Design der Website der Initiative, deren Ziel es ist, Mobilitätsmanagement in Polen einzuführen, basierend auf der Zusammenarbeit von Umgebungen, die Mobilität gestalten, mit der führenden Rolle der Gemeinschaft, die das Verkehrssystem nutzt. Die Veränderung, die das Projekt anstrebt, besteht darin, den Ansatz des Verkehrsmanagements von BBB (Build Build Build) zu einem Ansatz zu ändern, bei dem Verkehrsprojekte auf der Grundlage von Benutzererfahrung (UX) und messbaren Leistungsindikatoren (KPI) miteinander konkurrieren die Mobilität von Polen und Europäern. Auslöser des Wandels ist die digitale Revolution. Die aktuelle Technologie ermöglicht es, zuverlässige Daten in Echtzeit zu erhalten, und daher wird den IT-Systemen im Verkehr besondere Aufmerksamkeit geschenkt: GSM-R, ETCS, ITS, SESAR, RIS, VTMIS und soziale Medien.",
            "DescriptionPl": "Projekt strony inicjatywy, której celem jest wprowadzenie zarządzania mobilnością w Polsce opartej na współpracy śrdowisk kształtujących mobilność przy wiodącej roli społeczności korzytającej systemu transportowego. Zmiana, do której dąży projekt polega na zmianie podejścia do zarządzania transportem z BBB (Buduj Buduj Buduj) na podejście, w którym projekty transportowe konkurują ze sobą w oparciu o doświadczenia użytkowników (UX) oraz o mierzalne wskaźniki efektywności (KPI) nastawione na mobilność Polaków i Europejczyków. Wyzwalaczem zmiany jest rewolucja cyfrowa. Obecna technologia pozwala na pozyskiwanie wiarygodnych danych w czasie rzeczywistym i dlatego też szczególną uwagę poświęca się systemom IT w transporcie: GSM-R, ETCS, ITS, SESAR, RIS, VTMIS oraz mediom społecznościowym.",
            "technologies":["HTML", "CSS", "Javascript","JQuery","MySQL","MariaDB", "Sass", "Gulp", "Wordpress", "PHP", "YouTube API", "RSS"],
            "githublink": "https://github.com/AndrzejKobuszewski/NT4.git",
            "screenshot": "https://github.com/AndrzejKobuszewski/NT4/blob/master/wp-content/themes/NapedzamyTransport/images/screenshot_mini.png?raw=true",
            "link":""
        },
        "project4":{
            "title": "TourFast Warsaw",
            "titlePl": "TourFast Warszawa",
            "titleDe": "TourFast Warschau",
            "time": "2019",
            "Description": "Website created for a start-up offering quick sightseeing of the capital city of Warsaw in a modern and fast way on electric scooters.",
            "DescriptionPl": "Witryna zrealizowana dla start-upu, oferującego szybkie zwiedzanie miasta stołecznego Warszawy w nowoczesny i szybki sposób na hulajnogach elektrycznych.",
            "DescriptionDe": "Für ein Start-up erstellte Website, die eine schnelle Besichtigung der Hauptstadt Warschau auf moderne und schnelle Weise mit Elektrorollern bietet.",
            "technologies":["HTML", "CSS", "Javascript","PHP","MySQL","PHP My Admin","Wordpress","Elementor","Youtube API","Facebook API","Google translate API","Google Analytics"],
            "githublink": "",
            "screenshot":"./img/tourfast.png",
            "link":"https://TourFast.pl"
        },
        "project5":{
            "title": "MyResumee",
            "time": "2020",
            "Description": "The website was created during the COVID 19 pandemic in order to get acquainted with the Bootstrap 4 framework and the React 16 library in practice.",
            "DescriptionPl": "Strona powstała podczas pandemii COVID19 w celu praktycznego zapoznania się z frameworkiem Bootstrap 4 oraz biblioteką React.",
            "DescriptionDe": "Die Website wurde während der COVID-19-Pandemie erstellt, um das Bootstrap-4-Framework und die React-Bibliothek in der Praxis kennenzulernen.",
            "technologies":["HTML", "CSS","Bootstrap", "Javascript","Jquery","NodeJS - Gulp", "Sass"],
            "githublink": "https://github.com/AndrzejKobuszewski/AndrzejKobuszewski",
            "screenshot":"./img/myresumee.png",
            "link":"http://tourfast.pl/MyResumee/"
        },
        "project6":{
            "title": "Recruiment Task 1",
            "time": "2021",
            "Description": "The task was to create and test the application using the Jest library. The application was to reflect the graphic design, provide a form for entering user data and perform certain actions depending on the color and size of the clicked figure",
            "DescriptionPl": "Zadanie polegało na stworzeniu i przetestowaniu aplikacji za pomocą biblioteki Jest. Aplikacja miała zadanie dzwieciedlić projekt graficzny, dostarczać formularz do wprowadzania danych użytkownika oraz wykonywać określone działania w zależności od koloru i wielkości klikniętej figury",
            "DescriptionDe": "Die Aufgabe bestand darin, die Anwendung mithilfe der Jest-Bibliothek zu erstellen und zu testen. Die Anwendung sollte das grafische Design widerspiegeln, ein Formular zur Eingabe von Benutzerdaten bereitstellen und je nach Farbe und Größe der angeklickten Figur bestimmte Aktionen ausführen.",
            "technologies":["HTML", "CSS", "Javascript", "Jest"],
            "githublink": "https://github.com/AndrzejKobuszewski/ZadanieRekrutacyjneAlterPage",
            "screenshot":"./img/zadanieap.png",
            "link":"http://tourfast.pl/ZadanieAP/"
        },
        "project7":{
            "title": "Recruiment Task 2",
            "time": "2021",
            "Description": "Zadanie polegało na wytworzeniu aplikacji, która obliczaja odległość między dwoma zadanymi punktami geograficznymi",
            "DescriptionDe": "Die Aufgabe bestand darin, eine Anwendung zu erstellen, die die Entfernung zwischen zwei gegebenen geografischen Punkten berechnet",
            "DescriptionPl": "The task was to create an application that calculates the distance between two given geographic points",            
            "technologies":["HTML", "CSS", "Javascript","Vue","PHP"],
            "githublink": "https://github.com/AndrzejKobuszewski/Zadanie-Progamistyczne-PHP-Vue.js",
            "screenshot":"./img/zad2.png",
            "link":"http://tourfast.pl/ZadanieRekrutacyjne/index.php"
        },
        "project8":{
            "title": "Recruiment Task 3",
            "time": "2022",
            "Description":"The task was to prepare a WordPress plugin that will allow you to add your own HTML tags with Javascript support to a website.",
            "DescriptionPl": "Zadanie polegało na przygotowaniu wtyczki do WordPressa, która umożliwi dodawanie własnych tagów HTML z obsługą Javascript do strony internetowej.",
            "DescriptionDe":"Die Aufgabe bestand darin, ein WordPress-Plugin vorzubereiten, mit dem Sie Ihre eigenen HTML-Tags mit Javascript-Unterstützung zu einer Website hinzufügen können.",
            "technologies":["HTML", "CSS", "Javascript","PHP","Wordpress","MySql"],
            "githublink": "https://github.com/AndrzejKobuszewski/Zadanie-Progamistyczne-PHP-Vue.js",
            "screenshot":"",
            "link":"http://tourfast.pl/ZadanieRekrutacyjne/index.php"
        },
        "project9":{
            "title": "Emily",
            "time": "2023",
            "Description": "Website of doctor of medicine, specialist in radiology and imaging diagnostics, who deals with imaging diagnostics, including ultrasound diagnostics of breast and thyroid diseases.",
            "DescriptionPl":"„Strona internetowa lekarza medycyny, specjalisty radiologii i diagnostyki obrazowej, zajmującego się diagnostyką obrazową, w tym diagnostyką ultrasonograficzną chorób piersi i tarczycy.",
            "DescriptionDe":"Webseite eines Arztes, Facharzt für Radiologie und bildgebende Diagnostik, der sich mit bildgebender Diagnostik einschließlich Ultraschalldiagnostik von Brust- und Schilddrüsenerkrankungen befasst.",
            "technologies":["HTML", "CSS", "Javascript","MySql","Wordpress"],
            "githublink": "",
            "screenshot":"./img/emily.png",
            "link":""
        },

        "project10":{
            "title": "androo",
            "time": "2023",
            "Description": "Niniejszy serwis został stworzony w celu zaprezentowania siebie jako software developer",
            "DescriptionPl": "Hereby website for presenting myself as a sofware developer",
            "DescriptionDe": "Hiermit wurde eine Website erstellt, um mich als software entwickler zu präsentieren",
            "technologies":["HTML", "CSS", "Javascript","React","NodeJS - Webpack"],
            "githublink": "",
            "screenshot":"",
            "link":"#"    
        }

    },
    "recommendedBooksIntro":"I like learning new trhings from the books, bacause the books are more synthethic and thought over than publication you can find in the network. The Positions I read and I can recommend as valuable are as follows:",
    "recommendedBooksIntroPl":"Lubię uczyć się nowych rzeczy z książek, bo są one bardziej syntetyczne i przemyślane niż publikacje, które można znaleźć w sieci. Pozycje, które mogę przeczytać i które mogę polecić jako wartościowe, to:",
    "recommendedBooksIntroDe":"Ich lerne gerne Neues aus den Büchern, weil die Bücher synthetischer und durchdachter sind als Veröffentlichungen, die man im Netz finden kann. Die Positionen, die ich lesen und als wertvoll empfehlen kann, sind die folgenden:",
 
    
    "articles": {
        
        "article1": ["Image FILE","Title","Content"],
        "article1-pl": ["Image FILE","Title","Content"],
        "article1-de": ["Image FILE","Title","Content"],
        "article2": ["Image FILE","Title","Content"]
    }
    
    }
]